
'
'-
'.
'a
'about
'ah,
'all
'and
'anyway,
'are
'as
'because
'but
'can
'can't
'cause
'come
'course
'd'you
'did
'do
'dobby
'don't
'dumbledore
'em
'er
'for
'get
'give
'go
'good
'hagrid,
'harry
'harry,
'have
'he
'he's
'hem,
'hermione,
'hey,
'hi,'
'how
'i
'i'd
'i'll
'i'm
'i've
'if
'in
'is
'it
'it's
'just
'kreacher
'leave
'let
'let's
'like
'look
'look,
'maybe
'my
'never
'no
'no!'
'no,
'no,'
'not
'now
'now,
'of
'oh
'oh,
'oh,'
'ok,
'ok,'
'one
'only
'or
'potter,
'professor
'right,'
'see
'she
'she's
'shut
'sirius
'so
'so,
'so,'
'that
'that's
'the
'then
'there
'they
'this
'umbridge
'very
'was
'we
'we'll
'we're
'we've
'weasley
'well
'well,
'well,'
'what
'what's
'what?'
'when
'where
'where's
'who
'who's
'why
'why?'
'yeah
'yeah,
'yeah,'
'yes
'yes,
'yes,'
'you
'you'll
'you're
'you've
'your
*
-
-'
.
."
.'
?'
a
able
abou'
about
about,
about.
about?'
above
absolutely
accompanied
according
across
act
acting
actually
added
added,
addressed
admit
afraid
after
afternoon
again
again,
again,'
again.
again.'
again;
again?'
against
age
ago
ago,
ago.
agreed
ahead
air
air,
air.
alarmed.
albus
alicia
alive
all
all,
all,'
all.
all.'
alley
alleyway
allow
allowed
allowing
almost
alone
alone,
along
already
also
always
am
among
amount
an
an'
ancient
and
and,
angelina
angelina,
anger
angrily
angrily,
angrily.
angry
another
answer
answer.
anxious
anxiously
anxiously.
any
anybody
anyone
anything
anything,
anyway
anyway,
anyway,'
anyway?'
anywhere
apart
apparently
appear
appearance
appeared
archway
are
are,
are,'
aren't
arm
arm.
armchair
arms
around
around,
around.
arrived
arthur
arts
as
aside
ask
asked
asked,
asked.
asking
asleep
at
attack
attacked
attempt
attempted
attempting
attention
aunt
auror
avoid
aware
away
away,
away.
awoke
azkaban
back
back,
back.
back.'
backwards
backwards,
bad
badge
badly
bag
bag.
ball
barely
barked
be
be,
beak
beamed
beaming
bear
beating
became
because
become
becoming
bed
bed,
bed.
bedroom
bedside
been
before
before,
before.
began
began.
behind
being
believe
believed
bell
bellatrix
bellowed
below
below.
bench
bending
beneath
bent
beside
best
bet
better
better,
between
beyond
big
bill
bin
bit
bite
bits
black
blame
blank
blankly.
bleeding
blood
bludger
blue
body
body,
bones
bones,
book
books
bored
born
both
bother
bottle
bottom
bound
bow
bowl
bowtruckle
box
boy
boy,
brain
brains
brave
break
breakfast
breaking
breath
breath,
breath.
breathed
breathing
bright
brightly,
bring
bringing
broke
broken
broom
brother
brought
brown
bu'
burning
burst
bus
business
busy
but
butterbeer
by
cabin
cage
call
called
calling
calm
calmly.
came
can
can't
cannot
car
care
carefully
carpet
carried
carry
carrying
case
case,
cast
casting
castle
castle,
castle.
catch
catching
caught
cauldron
caused
causing
cedric
ceiling
ceiling,
ceiling.
centaur
centaurs
centre
certain
certainly
chair
chair,
chair.
chairs
chance
chang
change
changed
changing
charm
charms
check
checked
checking
chest
chest.
children
cho
cho's
cho,
cho.
chocolate
choice
chose
chosen
christmas
circular
clapped
class
class,
class.
classes
classroom
clean
clear
cleared
clearly
clenched
clever
climbed
clipboard
clipboard.
cloak
cloak.
close
closed
closely
closely.
closer
closing
clutched
clutching
cold
cold,
cold.
coldly.
colour
come
comes
coming
common
complete
completely
confederation
confused
considered
contact
continue
continued
continued,
continuing
contrary,
control
conversation
convinced
cool
coolly.
copy
cornelius
corner
corner,
corridor
corridor,
corridor.
corridors
could
couldn't
count
couple
course
course,
course,'
cover
covered
covering
crabbe
crack
crash
creaked
creature
creatures
crept
cried
crookshanks
crossed
crowd
crying
crystal
cup
cupboard
curled
curse
curtains
cut
d
d'you
da
dad
dad's
daily
danger
dangerous
dare
dark
dark,
darkly.
darkness
dashed
date
day
day,
day.
days
dead
dead,
deal
dean
dean,
dear
dear,
dear,'
death
decide
decided
decree
deep
deep,
deeply
defence
defensive
definitely
delighted
demanded
dementor
dementors
dementors,
department
descended
deserted
desire
desk
desk,
desk.
desperate
desperately.
detention
determined
did
did,
did,'
didn'
didn't
died
different
difficult
dinner
direction
directly
dirty
disappeared
distant
distinctly
dived
divination
do
do,
do,'
do.
do?'
dobby
does
doesn't
dog
doing
doing,
doing?'
dolores
don'
don't
done
done,
door
door,
door.
doors
doorway
dormitory
double
doubt
down
down,
down.
downstairs
dozen
draco
dragged
dragging
dragon
draw
drawing
drawn
dreadful
dream
dreamed
dreams
drew
drink
drive
drop
dropped
dropping
drops
ducked
dudley
dudley's
dudley,
due
dull
dumbledore
dumbledore's
dumbledore,
dumbledore.
dumbledore?'
dungeon
dunno
during
dursleys
dusty
each
eager
eagerly
eagerly.
ear
ear.
early
ears
ears.
earth
easier
easily
easy
eater
eaters
eating
echoed
echoing
edge
educational
effort
eh?'
either
elf
else
emerged
emerging
empty
end
end,
enjoying
enormous
enough
enough,
entered
entrance
envelope
er
ernie
escape
escaped
essay
even
evening
evening,
ever
ever,
ever.
every
everybody
everyone
everything
evidence
evidently
exactly
exam
examination
examining
exams
except
exchanged
excitement
excuse
expect
expected
expecting
expelled
explain
expression
extendable
extra
extremely
eye
eye,
eye.
eyebrows
eyeing
eyes
eyes,
eyes.
face
face,
face.
face;
faces
facing
fact
fact,
faint
fall
fallen
falling
familiar
family
far
fast
fat
father
fault
favourite
fawkes
fear
feeble
feel
feeling
feelings
feet
feet,
feet.
fell
fellow
felt
female
fer
few
fifteen
fifty
figg
fight
fighting
figure
figures
filch
filch,
filled
filthy
final
finally
finally,
find
finding
fine
fine,
fine,'
finger
fingers
finish
finished
finished,
fire
fire,
fire.
firenze
firmly
firmly.
first
first-years
fist
fists
fit
five
fixed
flames
flat
flew
flight
flitwick
floated
floating
floo
floor
floor,
floor.
flung
fly
flying
folded
follow
followed
following
food
foot
footsteps
for
for,
for?'
forbidden
force
forced
forcing
forehead
forest
forest,
forest.
forget
forgot
forgotten
form
forward
forwards
forwards,
fought
found
fountain
four
fourth
fred
fred,
fred.
free
fresh
friend
friends
frightened
frog
from
front
frowning
frowning.
fudge
fudge,
fudge.
full
fully
fun
funny
furious
furiously,
furiously.
further
galleons
gang
gasped
gave
gaze
gazed
gazing
gently
george
george's
george,
george.
get
gets
getting
giant
giants
ginny
ginny's
ginny,
ginny.
girl
girls
girls'
give
given
giving
glad
glance
glanced
glancing
glared
glaring
glass
glasses
gleaming
glimpse
glittering
go
go!'
go,
goblin
godfather
going
gold
golden
gone
gone.
good
good,
good,'
got
goyle
grabbed
grass
grawp
grawp's
great
green
greeted
grew
grey
grimly.
grimmauld
grin
grinning
grinning.
grip
ground
ground,
ground.
grounds
grounds.
group
growing
growled
grubbly-plank
grubbly-plank,
gryffindor
gryffindors
guard
ha
had
had,
hadn't
hagrid
hagrid's
hagrid,
hagrid,'
hagrid.
hagrid?'
hair
hair.
half
halfway
hall
hall,
hall.
halt
hand
hand,
hand.
handed
handing
hands
hands,
hands.
hanging
happen
happened
happened,
happened.
happening
happily.
happiness
happy
hard
harder
hardly
harry
harry!'
harry'
harry's
harry,
harry,'
harry.
harry.'
harry?'
has
hasn't
hastily
hastily,
hat
hate
hated
hats
have
haven't
having
he
he'd
he'll
he's
he,
he?
he?'
head
head,
head.
headed
heading
headless
headmaster
headquarters
heads
heads.
healer
hear
heard
hearing
heart
heaved
heavily
heavily.
heavy
hedwig
hedwig's
heel
held
help
helped
helping
her
her,
her,'
her.
her.'
her?'
here
here!'
here,
here,'
here.
here.'
here?'
hermione
hermione's
hermione,
hermione,'
hermione.
herself
hesitated,
hidden
hide
hiding
high
high-pitched
higher
highly
him
him!'
him,
him,'
him.
him.'
him;
him?
him?'
himself
himself,
himself.
his
history
hit
hitting
hog's
hogsmeade
hogwarts
hogwarts,
hogwarts.
hold
holding
hole
holidays
home
homework
homework.
hope
hoping
horrible
horribly
horse
horses
hospital
hot
hour
hours
house
house,
house-elf
house.
houses
how
however,
hufflepuff
huge
human
hundred
hung
hurried
hurrying
hurt
hushed
i
i'd
i'll
i'm
i've
i?'
icy
idea
idea,'
if
ignore
ignored
ignoring
imagine
imagined
immediately
impatiently,
impatiently.
important
impression
in
in,
in.
inch
inches
including
indeed
indeed,
indignantly.
information
informed
ink
inquisitor
inquisitorial
inside
inside,
inside.
insides
instead
instead,
instructions
instrument
interest
interested
interesting
international
interrupted
interview
into
invisibility
invisible
irritably,
is
is,
is,'
is?'
isn't
it
it!
it!'
it'll
it's
it,
it,'
it.
it.'
it;
it?
it?'
its
itself
james
jar
jeans
jerked
jet
jinx
jinxes
job
join
joined
joke
journey
jumped
jumping
jus'
just
katie
keen
keep
keeper
keeping
kept
kicked
kill
killed
kind
kindly
kingsley
kissing
kitchen
kitchen,
kitchen.
knees
knew
knew,
knife
knocked
know
know!'
know,
know,'
know.
know?'
knowing
knowledge
known
knows
kreacher
kreacher's
laid
landed
landing
lap
large
large,
larger
last
last,
later
later,
later.
laugh
laugh.
laughed
laughed.
laughing
laughter
laughter.
lavender
lawn
lay
lead
leading
leaned
leaning
leaping
leapt
learn
learned
learning
least
leave
leaving
led
lee
left
left,
left.
leg
legs
legs,
length
less
lesson
lessons
let
let's
letter
letter.
letters
letting
level
lie
life
lift
lifted
light
light,
light.
lights
like
like,
like,'
liked
likely
line
lined
lines
lip
lips
list
listen
listened
listening
lit
little
live
living
loads
locked
long
long,
longbottom
longer
look
look,
look.
looked
looking
looks
lord
lose
losing
lost
lot
loud
loud,
louder
loudly
loudly,
loudly.
love
lovegood
low
lower
lowered
lucius
lucky
luna
luna,
luna.
lunch
lupin
lupin,
lupin.
lying
mad
mad-eye
madam
made
magazine
magic
magic,
magic.
magical
magnolia
make
makes
making
malfoy
malfoy's
malfoy,
malfoy.
man
man's
man,
managed
many
marble
marchbanks
marched
marietta
mark
marks
mass
massive
master
match
mate,'
matter
may
maybe
mcgonagall
mcgonagall's
mcgonagall,
mcgonagall.
me
me!'
me,
me,'
me.
me.'
me?'
mean
mean,
mean?'
means
meant
meanwhile,
meet
meeting
meetings
member
members
memories
memory
mention
mentioned
merely
message
met
michael
midair
middle
might
miles
mind
mind,
mind,'
mind.
minister
ministry
ministry's
ministry,
minute
minutes
minutes,
mirror
miserable
miss
missed
missing
mistake
moment
moment,
moment.
moments
montague
month
months
mood
moody
moody's
moody,
moody.
more
more,
more.
morning
morning,
morning.
most
mother
mother's
mother,
mouth
mouth,
mouth.
move
moved
movement
moving
mr
mrs
much
much,
muffled
muggle
muggles
mum
mumbled.
mundungus
mundungus,
mungo's
must
muttered
muttered,
muttered.
muttering
my
myself
mysteries
name
name.
named
names
narrow
narrowly
nasty
near
nearby
nearer
nearest
nearly
neatly
neck
neck.
need
needed
needs
neither
nervous
nervously
never
neville
neville's
neville,
neville.
new
news
news,
newspaper
next
nice
nick
nigellus
night
night,
night.
nine
no
no!'
no,
no,'
nobody
nod
nodded
nodded,
nodded.
nodding
noise
noise.
noises
none
nor
normal
nose
nose.
not
not,
not,'
not.
note
notes
nothing
nothing,
nothing.
notice
noticed
now
now,
now,'
now.
now.'
now?
now?'
number
o'
o'clock
obviously
occasionally
occlumency
occurred
odd
oddly
of
off
off,
off.
offered
office
office,
office.
often
oh
oh,
ok
ok,
ok,'
old
on
on!'
on,
on,'
on.
once
once,
once.
one
one's
one,
one,'
one.
ones
only
open
open,
open.
opened
opportunity
opposite
or
orange
order
order,
orders
other
other,
other.
others
others,
others.
ought
our
out
out!'
out,
out,'
out.
outside
over
over,
over.
owl
owl,
owls
own
packed
page
pain
pair
pale
pale,
panic
pansy
panting
paper
parchment
parchment,
parchment.
parents
parents,
parkinson
part
particularly
parvati
pass
passed
passed,
passed.
passing
past
patch
patronus
pause
paused
pay
peered
peering
peeves
pensieve
people
people,
perched
percy
percy's
perfectly
perhaps
perhaps,
person
persuade
petunia
phineas
phoenix
picked
picking
picture
pictures
piece
pile
pink
pitch
pitch,
place
place,
place.
placed
plain
plainly
plan
planning
plans
plate
play
playing
please
pleased
pleasure
plenty
pocket
pocket.
point
point,
pointed
pointing
points
poking
poor
portrait
portraits
position
positively
possible
possibly
post
potion
potions
potter
potter!'
potter,
potter,'
potter.
potter.'
potter?'
power
powerful
practical
practice
practise
practising
prefect
presence
present
pressed
pretend
pretended
pretending
pretty
previous
private
privet
probably
problem
professor
progress
promise
prophecy
prophecy,
prophet
prospect
pull
pulled
pulling
purple
pushed
pushing
put
putting
quaffle
question
questions
quibbler
quick
quickly
quickly,
quickly.
quidditch
quiet
quietly
quietly,
quietly.
quill
quills
quite
rage
rage.
rain
raised
raised.
raising
ran
rang
rapidly
rather
rattling
ravenclaw
reach
reached
read
reading
ready
real
realise
realised
really
reason
received
recent
recently
reckon
recognised
red
regular
relief
relieved
remain
remained
remaining
remember
remembered
remembering
remind
reminded
remove
removed
repeated
repeated.
replaced
report
required
rest
return
returned
returning
rid
right
right,
right,'
right.
right?
right?'
ripped
rising
risk
rita
road
roar
roared
robes
robes,
robes.
roger
roll
rolled
rolling
ron
ron's
ron,
ron,'
ron.
room
room,
room.
rose
round
round.
rounded
row
rubbing
rubbish
run
run,
running
rush
s
safe
said
said,
said.
same
sank
sat
save
saved
saw
saw,
say
say,
say.
say?'
saying
saying,
says
scar
scared
scarlet
school
school,
scrambled
scratching
scream
screamed
screaming
screwed
scribbling
seamus
seat
seats
second
second,
seconds
seconds,
secret
security
see
see,
see,'
seeing
seem
seemed
seems
seen
seize
seized
send
sensation
sense
sent
serious
seriously
set
setting
settled
seven
seventh
several
shade
shaking
shall
sharp
sharply,
sharply.
she
she'd
she'll
she's
she,
she?'
shelves
shining
shock
shocked.
shook
shooting
short
shortly
shortly.
shot
should
shoulder
shoulder,
shoulder.
shoulders
shouldn't
shouted
shouted,
shouted.
shouting
show
showed
showing
shrieked
shrieking
shut
sick
side
side,
side.
sideways
sighed
sight
sight.
sign
signs
silence
silence.
silent
silent.
silver
silvery
simply
since
singing
single
sinking
sir
sir,
sir,'
sirius
sirius's
sirius,
sirius.
sit
sitting
six
sixteen
size
skin
skiving
sky
slammed
slamming
sleep
slid
sliding
slight
slightest
slightly
slightly,
slightly.
slipped
slow
slowly
slowly,
slowly.
slytherin
slytherins
small
small,
smashed
smell
smile
smile.
smiled
smiling
smiling.
smoke
snake
snape
snape's
snape,
snape.
snapped
snarled
snatched
sneak
snitch
snow
so
so,
so.
soared
soaring
sobbing
soft
softly,
softly.
some
somebody
somehow
someone
something
something,
sometimes
somewhere
soon
soon,
sorry
sorry,
sort
sorting
sound
sounded
sounding
sounds
source
space
speak
speak.
speaking
sped
spell
spells
spent
spinning
split
spoke
spoke,
spoke.
spot
spotted
sprang
spread
sprinted
sprout
square
squeezed
st
staff
staircase
staircase.
stairs
stairs,
stairs.
stand
standing
stared
staring
start
started
starting
station
statue
stay
staying
steadily
steak
step
stepped
steps
sticking
still
still,
stomach
stone
stood
stop
stopped
stopping
story
straight
straightened
strange
street
stretched
stretching
striding
strode
strong
struck
struggled
struggling
stubby
stuck
student
students
students,
study
stuff
stuffed
stunning
stupid
sturgis
subject
such
sudden
suddenly
suggested
summer
sun
sunlight
support
suppose
supposed
sure
surely
surface
surprise
surprise.
surprised
surrounded
surrounding
surveyed
swallowed
swayed
swaying
swear
sweeping
swept
swinging
swooped
swung
t
table
table,
table.
tables
take
taken
takes
taking
talk
talked
talking
tall
tapestry
taught
tea
teach
teacher
teacher,
teachers
teaching
team
tears
teeth
teeth.
telephone
tell
telling
temper
ten
tentatively.
ter
term
terrible
terrified
terror
test
tha's
than
thank
thanks,'
that
that!'
that's
that,
that,'
that.
that.'
that?'
the
their
them
them,
them,'
them.
them.'
them;
them?'
themselves
then
then,
then,'
then?'
theory
there
there!'
there's
there,
there,'
there.
there.'
there?'
therefore
these
thestral
thestrals
they
they'd
they'll
they're
they've
they?'
thick
thin
thing
thing,
things
things?'
think
think,
thinking
thinks
third
this
this,
this,'
this.
this?'
thoroughly
those
though
though,
thought
thought,
thoughts
three
threw
throat
through
throw
throwing
thrown
thrust
tied
tight
tightly
till
time
time,
time.
time.'
times
tiny
tip
to
to,
to,'
to.'
today
together
together,
together.
told
tomorrow
tone
tonight,
tonks
tonks,
too
too,
too,'
too.
too.'
took
top
tore
touch
touched
towards
tower
towering
train
training
transfiguration
trapped
travelling
tree
trees
trelawney
trelawney's
trelawney,
trembling
tried
triwizard
trouble
true
trunk
trunks
trust
truth
try
trying
turn
turned
turning
twelve
twenty
twice
twins
twisted
two
two,
ugly
umbridge
umbridge's
umbridge,
umbridge.
unable
unaware
uncle
under
understand
understood
unless
unpleasant
until
up
up!'
up,
up,'
up.
upon
upside-down
upstairs
upwards
us
us,
us.'
us?'
use
used
using
usual
usual.
usually
utterly
vaguely
vanished
vanished.
vanishing
various
vernon
vernon's
vernon,
vernon.
very
view
visible
vision
visit
voice
voice,
voice.
voices
voldemort
voldemort's
voldemort,
wait
waited
waiting
wake
walk
walked
walking
wall
wall,
wall.
walls
walls,
wand
wand,
wand.
wands
want
wanted
wanting
wants
ward
warm
warned
warning
was
was,
was.
wasn't
watch
watched
watching
water
wave
waved
waving
way
way,
way.
we
we'd
we'll
we're
we've
we?'
weak
weapon
wearing
weasley
weasley's
weasley,
weasley.
week
week,
weeks
weight
well
well,
well,'
well.
went
were
were,
weren't
what
what's
what?'
whatever
wheeled
when
whenever
where
whether
which
while
while,
whisper
whispered
whispered,
whispered.
whispering
white
who
who's
whole
whom
whose
why
wide
widely
wildly
will
wind
window
window,
window.
windows
windows.
wing
winged
wings
wiping
wish
wished
witch
witches
with
withdrew
within
without
wizard
wizarding
wizards
wizengamot
woman
won't
wonder
wondered
wonderful
wondering
wood
wooden
word
word,
words
words.
wore
work
work,
worked
working
world
wormtail
worried
worry
worse
worst
worth
would
wouldn't
wrapped
wrenched
write
writing
written
wrong
yeah
yeah,
yeah,'
year
year,
year,'
year.
years
yeh
yeh,
yelled
yelled,
yer
yes
yes,
yes,'
yet
yet,
you
you!'
you'd
you'll
you're
you've
you,
you,'
you-know-who
you-know-who's
you.
you.'
you?
you?'
young
your
yourself
zacharias
zoomed
