
"a
"the
'
'-
'.
'a
'about
'after
'ah
'ah,
'ah,'
'all
'an
'an'
'and
'another
'anything
'anyway
'anyway,
'are
'as
'at
'be
'because
'bet
'bit
'blimey,
'but
'but,
'by
'can
'can't
'cause
'come
'couldn't
'course
'd'you
'did
'didn't
'do
'dobby
'does
'don't
'dumbledore
'dumbledore's
'e
'em
'er
'er,'
'erm
'even
'excellent,'
'fine,'
'five
'for
'fred
'fudge
'get
'ginny
'give
'go
'good
'good,'
'got
'had
'hagrid
'hagrid,
'hang
'harry
'harry!
'harry!'
'harry's
'harry,
'harry,'
'harry?'
'has
'have
'haven't
'he
'he's
'hello,
'hem,
'here
'here,'
'hermione
'hermione,
'hermione,'
'hey
'hey,
'hi,
'hi,'
'his
'how
'how're
'i
'i'd
'i'll
'i'm
'i've
'if
'im
'in
'is
'it
'it'll
'it's
'its
'just
'keep
'kreacher
'last
'leave
'let
'let's
'level
'like
'listen
'listen,
'look
'look,
'look,'
'master
'maybe
'me
'merry
'more
'mr
'mum
'my
'nah,
'never
'nice
'no
'no!'
'no,
'no,'
'nor
'not
'nothing
'nothing,'
'now
'now,
'of
'oh
'oh,
'oh,'
'ok,
'ok,'
'on
'one
'only
'or
'our
'over
'people
'please
'potter
'potter,
'professor
'put
'quite
'really
'remember
'right
'right,
'right,'
'ron
'ron's
'ron,
'see
'shall
'she
'she's
'shut
'sirius
'sirius!'
'sirius,
'snape
'so
'so,
'so,'
'some
'something
'still,
'stop
'stupefy!'
'surely
'that
'that's
'the
'then
'there
'there's
'they
'they're
'this
'those
'to
'umbridge
'very
'wait
'was
'we
'we'll
'we're
'we've
'weasley
'well
'well,
'well,'
'well?'
'what
'what's
'what?
'what?'
'when
'where
'where's
'which
'who
'who's
'why
'why,
'why?'
'will
'with
'would
'yeah
'yeah,
'yeah,'
'yeh
'yep,'
'yes
'yes,
'yes,'
'yes.'
'yes?'
'you
'you'd
'you'll
'you're
'you've
'your
(harry
(she
*
-
-'
.
."
.'
?'
a
aback
abandon
abandoned
ability
able
abou'
about
about,
about.
about?'
above
above,
above.
abrupt
abruptly
abruptly.
absence
absolutely
absorbed
accept
accidents
accompanied
according
account
accused
achieved
aching
across
act
acting
actually
add
added
added,
adding
addition
addressed
admit
admitted
advanced
advice
advise
afraid
after
afternoon
afternoon,
afternoon.
again
again,
again,'
again.
again.'
again;
again?'
against
age
ages
ago
ago,
ago.
agreed
ahead
ahead,
aim
air
air,
air.
aisle
alarm
alarmed
alarmed.
albus
alice
alicia
alive
alive,
all
all,
all,'
all.
all.'
all;
alley
alleyway
allow
allowed
allowing
almost
alone
alone!'
alone,
alone.
along
along,
aloud
already
already,
also
alter
although
always
always,
am
am,
am,'
ambition
amid
among
amongst
amount
amounts
an
an'
ancient
and
and,
angelina
angelina's
angelina,
angelina.
anger
anger,
angrily
angrily,
angrily.
angry
angry.
anguished
announced
annoyed
another
answer
answer,
answer.
answered
answering
answers
anthony
anxious
anxious.
anxiously
anxiously,
anxiously.
any
anybody
anyone
anyone's
anything
anything,
anything.
anything.'
anyway
anyway,
anyway,'
anyway.
anyway?'
anywhere
apart
apart,
apparently
apparently,
appear
appearance
appeared
appearing
applied
appointed
approached
approaching
approval
archway
are
are,
are,'
are.'
area
aren'
aren't
arm
arm,
arm.
armchair
arms
arms,
arms.
around
around,
around.
around;
arrival
arrived
arrived,
arrived.
arrogant
arthur
arthur,'
arts
arts,
as
ashamed
aside
ask
asked
asked,
asked.
asking
asleep
assured
astronomy
at
atrium
attack
attacked
attacking
attempt
attempted
attempting
attempts
attend
attention
attention.
attitude
audible
aunt
auror
aurors
authority
automatically
avery
avoid
avoided
avoiding
awaiting
awake
aware
away
away,
away.
awful
awkward
awoke
azkaban
azkaban,
azkaban.
b
baby
baby-headed
back
back,
back,'
back.
back.'
back?'
backed
backwards
backwards,
bad
bad,
bad,'
badge
badge.
badges
badly
bag
bag,
bag.
bags
ball
balls
ban
bane
bang
bang.
banging
bangs
banned
bar
barely
barked
barn
basement
battered
be
be,
be.
beak
beamed
beaming
beaming,
beaming.
bear
beard
beard,
bearded
bearing
beasts
beat
beating
beautiful
became
because
beckoned
become
becoming
bed
bed!'
bed,
bed,'
bed.
bedroom
bedroom,
bedroom.
beds
bedside
beech
been
been,
been?'
before
before,
before.
beg
began
began,
began.
beginning
behaviour
behind
being
believe
believed
believes
bell
bell,
bellatrix
bellatrix,
bellatrix.
bellowed
bellowed,
belong
below
below.
bench
benches
bending
beneath
bent
beside
best
best,
bet
better
better,
better,'
between
bewitched
beyond
big
biggest
bill
bill's
bin
binns
binns,
birds
bit
bit,'
bit.'
bite
bits
bitter
bitterly,
bitterly.
black
black's
black,
blackboard
blame
blank
blankly
blankly.
bleeding
blew
blinking
block
blocking
bloke
blond
blonde
blood
blood,
blood.
blowing
bludger
blue
blurred
board
bobbing
bode
bode,
body
body,
body.
boggart
boiling
bolt
bones
bones,
bones.
book
book,
books
books,
books.
booming
bore
bored
born
both
bother
bothered
bothering
bottle
bottles
bottom
bought
bouncing
bound
bow
bowed
bowl
bowler
bowtruckle
box
boy
boy!'
boy's
boy,
boys
boys'
bracingly.
brain
brains
branch
branches
brandishing
brass
brave
break
breakfast
breakfast,
breaking
breakout
breath
breath,
breath.
breathed
breathing
breathlessly,
breathlessly.
brief
bright
brightly
brightly,
brightly.
brilliant
bring
bringing
briskly
briskly,
broke
broken
broom
broom.
brooms
broomstick
broomstick.
broomsticks
brother
brought
brow
brown
bu'
bulging
bullfrog
bunch
buried
burn
burned
burning
burst
bus
business
busy
but
but,
butterbeer
button
by
by.
c
cabin
cabin.
cabinet
cage
cage.
call
called
called,
calling
calm
calm,
calmly,
calmly.
came
came,
came.
can
can't
can't,
can,
can,'
candle
candles
cannot
cap
car
cards
care
care.
cared
career
careers
careful
careful,
carefully
carefully,
carpet
carriage
carried
carry
carrying
cars
case
case,
cast
casting
castle
castle,
castle.
cat
catch
catching
caught
cauldron
cauldrons
cause
caused
causing
cedric
ceiling
ceiling,
ceiling.
centaur
centaur's
centaur,
centaurs
centre
certain
certainly
chair
chair,
chair.
chairs
chance
chang
change
changed
changing
chapter
charge
charged
charm
charms
charms,
chased
chasing
chat
chatting
check
checked
checking
cheeks
cheerful
cheering
chest
chest,
chest.
children
chin
chink
cho
cho's
cho,
cho.
chocolate
choice
choking
choose
chorus
chose
chosen
christmas
chucked
circling
circular
circumstances
clapped
class
class,
class.
classes
classroom
clatter
clattered
clattering
clean
clear
clear,
cleared
clearer
clearing
clearly
clenched
clever
clicked
climbed
clipboard
clipboard.
cloak
cloak,
cloak.
close
closed
closely
closely.
closer
closest
closing
clothes.
cloud
clown
club
clue
clutched
clutching
coast
cold
cold,
cold.
coldly,
coldly.
collapsed
collided
colour
come
come.
comes
comfortable
coming
coming?'
committed
common
community
company
compared
compartment
complete
completely
concealed
concentrate
concentration,
concern
concerned
confederation
confused
connection
consider
considered
considering
contact
contained
contents
continue
continued
continued,
continuing
contrary,
control
conversation
conversation,
convicted
convince
convinced
cool
coolly,
coolly.
cope
copies
copy
cornelius
corner
corner,
corner.
correct
corrected
corridor
corridor,
corridor.
corridors
corridors,
cough
could
could've
couldn't
count
counting
couple
course
course,
course,'
cousin
cover
covered
covering
covers
cow
crabbe
crabbe,
crack
crack.
cracked
crammed
crash
crawled
creaked
creaking
creature
creatures
creeping
creevey
crept
crescent
cried
cried,
cries
criminal
crookshanks
crookshanks,
cross
crossbow
crossed
crossing
crouch
crouched
crowd
crowd,
crowd.
crumble
crumple-horned
crumpled
cry
crying
crystal
cup
cupboard
curiosity
curious
curled
curly
currently
curse
curses
curtain
curtains
curtly.
cushion
cushions
cut
cuts
d
d'you
da
dad
dad's
dad,
daily
dais
dais.
damage
damage,
damp
dancing
danger
dangerous
dangling
dare
dared
daresay
daring
dark
dark,
dark.
darkly,
darkly.
darkness
darkness.
darted
dashed
date
davies
dawned
day
day,
day.
daylight
days
days,
days.
dead
dead,
deal
dean
dean,
dean.
dear
dear,
dear,'
dear?'
death
death,
deaths
decent
decide
decided
decision
decorated
decree
deep
deep,
deeper
deeply
deeply.
defence
defend
defensive
definite
definitely
deliberately
delighted
delivered
demanded
demanded,
demanded.
dementor
dementors
dementors,
dementors?'
departed
department
departure
deposited
descended
deserted
desire
desk
desk,
desk.
desks
desperate
desperately,
desperately.
despite
destroy
detail
details
detention
detentions
determined
determinedly
devil's
devoted
diagon
diary
did
did,
did,'
did.
didn'
didn't
didn't,'
die
died
died,
died.
difference
different
difficult
difficult,
difficulty
diggory
dilys
dim
dimly
dinner
dinner,
direction
direction,
direction.
directions.
directly
dirty
disappeared
disappearing
disappointed
disappointed.
disappointment
disapproving
disciplinary
discuss
discussing
disguise
dislike
distance
distance.
distant
distinct
distinctly
distracted
disturbed
dived
divination
divination.
do
do!'
do,
do,'
do.
do.'
do?'
dobby
dobby,
dock
dodged
dodges
does
doesn't
dog
doing
doing,
doing.
doing?'
dolohov
dolohov,
dolores
don'
don't
don't,'
done
done,
done.
door
door,
door.
door.'
door;
doorknob
doors
doors,
doors.
doorway
dormitories
dormitory
double
doubt
doubted
down
down!'
down,
down,'
down.
downstairs
doxy
doxys
dozen
draco
dragged
dragging
dragon
dragons
drained
draped
draught
draw
drawing
drawn
dread
dreadful
dream
dream,
dreamed
dreaming
dreams
dreams.
dreamy
dress
dressed
dressing
drew
drifted
drifting
drink
drink.
drinking
drive
drive,
drive.
drop
dropped
dropping
droppings
drops
dry
dry.
ducked
dudley
dudley's
dudley,
dudley.
due
dull
dully
dully,
dully.
dumbledore
dumbledore!'
dumbledore's
dumbledore,
dumbledore,'
dumbledore.
dumbledore.'
dumbledore;
dumbledore?'
dungeon
dungeon.
dunno
dunno,
dunno,'
during
dursleys
dursleys'
dust
dusty
duty
dying
each
eager
eagerly
eagerly,
eagerly.
ear
ear,
ear.
earlier
early
early,
earnestly.
ears
ears,
ears.
earth
easier
easily
easter
easy
eat
eater
eater's
eaters
eaters,
eaters.
eating
echoed
echoing
edge
edgecombe
edged
educational
effect
effort
egg
eggs
eh?'
eight
either
either.
eleven
elf
elf,
else
else,
else.
emerald
emerged
emerging
emotion
empty
empty.
end
end,
end.
ended
ends
endure
energy
enjoy
enjoying
enormous
enough
enough,
enough,'
enough.'
ensure
enter
entered
entered,
entered.
enthusiasm.
enthusiastically,
entire
entirely
entitled
entrance
envelope
equally
er
ernie
ernie,
erupted
escape
escaped
especially
essay
essence
etc.
etched
even
evening
evening,
evening.
events
ever
ever,
ever.
every
everybody
everyone
everyone's
everyone,
everything
everything,
everything.
everywhere
evidence
evidently
evil
exactly
exam
examination
examination,
examine
examined
examining
exams
excellent
except
exceptionally
exchanged
excitedly
excitedly,
excitedly.
excitement
excuse
exhausted
exit
expect
expected
expecting
expel
expelled
expelled,
experience
experienced
explain
explained
explanation
exploded
express
expression
expulsion
extendable
extinguished
extra
extremely
eye
eye,
eye.
eyebrows
eyebrows.
eyeing
eyes
eyes,
eyes.
f
face
face,
face.
face;
faced
faces
faces.
facing
fact
fact,
faded
fading
failed
failing
faint
fainter
faintly
fair
fake
fall
fallen
falling
false
falsely
familiar
family
famous
fancied
fancy
fang
fangs
far
far,
far.
fashion
fast
fast,
fast.
faster
fat
father
father's
father,
fault
favour
favourite
fawkes
fear
fears
feathers
feeble
feel
feel,
feeling
feelings
feet
feet,
feet.
fell
fellow
felt
female
fer
fetch
few
fiercely.
fiery
fifteen
fifth
fifth-years
fifty
figg
figg,
figg.
fight
fighting
figure
figures
filch
filch,
filing
fill
filled
filling
filthy
final
finally
finally,
find
finding
fine
fine,
fine,'
fine.'
finger
fingers
fingers,
fingers.
finish
finished
finished,
finishing
fire
fire,
fire.
firebolt
firenze
firenze's
firenze,
firenze.
fireplace,
fireplaces
fires
fireworks
firm
firmly
firmly,
firmly.
firs'
first
first,
first-years
first.
fist
fists
fit
fitted
five
fixed
fixedly
flagon
flame
flames
flames.
flapped
flapping
flared
flash
flashed
flashes
flat
flatly.
flattened
flaw
fleeting
flew
flicked
flickering
flight
flitwick
flitwick's
floated
floating
floo
floor
floor,
floor.
floor.'
floor;
floors
flown
fluffy
flung
flush
fluttered
fluttering
fly
flying
folded
follow
followed
followed.
following
food
food.
foolish
foot
foot.
footsteps
footsteps,
footsteps.
for
for,
for?'
forbidden
force
forced
forcefully.
forcing
forehead
forehead.
forest
forest,
forest.
forget
forgot
forgotten
fork
form
forming
forward
forwards
forwards,
forwards.
fought
foul
found
founders
fountain
fountain.
four
four,
fourteen
fourth
fragments
frame
frantically
fred
fred's
fred,
fred.
free
frequently
fresh
friday
friend
friend,
friendly
friends
frightened
frightened.
frog
from
front
front.
frown
frowned
frowning
frowning.
frozen
fudge
fudge's
fudge,
fudge.
fudges
full
fully
fun
funny
funny,
furious
furious.
furiously
furiously,
furiously.
further
fury
future
g
galleon
galleons
galloping
gang
gaping
garden
gargoyle
gas
gasp
gasped
gasped,
gates
gates.
gather
gathered
gathering
gave
gaze
gazed
gazing
general
generally
gentle
gently
george
george's
george,
george,'
george.
gestured
gesturing
get
gets
getting
giant
giants
gift
gigantic
giggling
gilderoy
ginger
ginny
ginny's
ginny,
ginny.
girl
girl,
girlfriend
girls
girls'
give
given
giving
glad
glance
glanced
glancing
glared
glaring
glass
glass.
glasses
glasses,
glasses.
gleaming
glimpse
glimpsed
glittering
gloom
gloomily.
gloomy
glow
glowed
glowering
glowing
gnarled
go
go!'
go,
go,'
go.
go.'
goal,
goblet
goblin
goblins
godfather
goes
goin'
going
going,
going?'
gold
golden
gone
gone,
gone.
gone.'
good
good,
good,'
good.
goodbye
got
got,
goyle
goyle,
grab
grabbed
grades
grandfather
granger,
granger,'
granger?'
grass
grateful
graveyard
grawp
grawp's
grawp,
greasy
great
great,
greatest
green
greeted
grew
grey
grilles
grim
grimly,
grimly.
grimmauld
grimy
grin
grinned.
grinning
grinning.
grip
gripped
gripping
gritted
groaned
ground
ground,
ground.
grounds
grounds,
grounds.
group
group.
grouped
groups
growing
growled
grown
grubbly-plank
grubbly-plank,
gruffly,
grunted
grunted.
grunting
gryffindor
gryffindor,
gryffindor.
gryffindors
guard
guard,
guarding
guessed
guilty
gulp
gurg
ha
had
had,
had.
hadn'
hadn't
hagrid
hagrid!'
hagrid's
hagrid,
hagrid,'
hagrid.
hagrid?'
hair
hair,
hair.
half
halfway
hall
hall,
hall.
halt
hammering
hand
hand,
hand.
handed
handful
handing
handkerchief
handle
handling
hands
hands,
hands.
handsome
hang
hanging
hangings
hannah
happen
happened
happened,
happened,'
happened.
happened?'
happening
happens
happier
happily
happily,
happily.
happiness
happy
hard
hard,
hard.
harder
hardly
harry
harry!'
harry'
harry's
harry,
harry,'
harry.
harry.'
harry;
harry?
harry?'
has
has,'
hasn't
hastened
hastily
hastily,
hastily.
hat
hat,
hat.
hate
hated
hatred
hats
hats.
have
have,
have,'
haven't
having
he
he'd
he'll
he's
he,
he?
he?'
head
head,
head.
head?'
headed
heading
headless
headmaster
headmasters
headmistress
headquarters
heads
heads.
healer
hear
hear,
heard
heard,
hearing
hearing.
heart
heart,
heat
heatedly.
heaved
heaven's
heavily
heavily.
heavy
hedwig
hedwig's
hedwig,
heel
heels
height
held
help
help,
help.
help.'
helped
helping
hem
hem.'
her
her!'
her,
her,'
her.
her.'
her;
her?'
herbology
herd
here
here!'
here,
here,'
here.
here.'
here?'
hermione
hermione's
hermione,
hermione,'
hermione.
hermione?'
hero
hers
herself
herself,
herself.
hesitated
hesitated,
hidden
hide
hiding
high
high,
high-pitched
higher
highly
him
him!'
him,
him,'
him.
him.'
him:
him;
him?
him?'
himself
himself,
himself.
himself;
hint
his
hissed
history
hit
hitting
hog's
hogsmeade
hogwarts
hogwarts,
hogwarts.
hoisted
hoisting
hold
holding
hole
holiday
holidays
holidays,
hollow
home
home,
homework
homework.
honestly
hooting
hope
hoped
hopeful
hopefully
hopefully,
hopefully.
hopes
hoping
horrible
horrible,
horribly
horrified
horrified.
horror
horror,
horror.
horse
horses
horses,
hospital
hot
hotly.
hour
hour-glass
hours
hours,
house
house,
house-elf
house-elves
house.
houses
hovering
how
however,
howling
hufflepuff
huge
hugely
hugging
human
humans
hunched
hundred
hundreds
hung
hurried
hurry
hurrying
hurt
hurting
hurtled
husband
hushed
i
i'd
i'll
i'm
i've
i,
i?
i?'
icy
idea
idea,
idea,'
idiot
idiots
if
ignore
ignored
ignoring
illegal
illuminated
image
imagine
imagined
imitation
immediate
immediately
immediately.
immense
immensely
impatiently,
impatiently.
impediment
imperius
importance
important
important,
impossible
impressed.
impression
impressive
in
in,
in.
inch
inches
including
incredulously.
indeed
indeed,
indicated
indicating
indignantly.
information
informed
ingredients
injured
injuries
ink
ink.
innocent
inquisitor
inquisitorial
inside
inside,
inside.
insides
insisted
inspection
instance,
instant
instead
instead,
instead.
instructions
instrument
instruments
intended
intending
intently
inter
interest
interest.
interested
interesting
interesting,
international
interrupt
interrupted
intervals
interview
into
invisibility
invisible
inviting
iron
irritably,
irritably.
is
is!'
is,
is,'
is.'
is?'
isn't
issued
issuing
it
it!
it!'
it'd
it'll
it's
it,
it,'
it.
it.'
it;
it?
it?'
its
itself
jabbed
james
james's
james,
james.
jane
jar
jar.
jaw
jeans
jerked
jet
jinx
jinxes
job
job,
job.'
johnson
johnson,
join
joined
joining
joke
jolt
jordan,
journey
judging
jump.
jumped
jumping
jus'
just
justin
karkus
katie
katie.
keen
keep
keeper
keeper,
keepin'
keeping
keeps
kept
kettle
kicked
kill
killed
killing
kind
kindly
king
king'
king's
king,
kingsley
kiss
kissed
kissing
kitchen
kitchen,
kitchen.
kneeling
knees
knees,
knees.
knew
knew,
knife
knight
knitting
knock
knocked
knocking
knot
know
know!'
know,
know,'
know.
know.'
know?'
knowing
knowledge
known
knows
knuckles
knut
kreacher
kreacher's
kreacher,
kreacher,'
lace.
lack
laden
lady
lady,
laid
lake
lake,
lamp
landed
landing
landing,
lap
large
large,
larger
largest
last
last,
last.
late
late,
later
later,
later.
latest
laugh
laugh,
laugh.
laughed
laughed,
laughed.
laughing
laughing.
laughter
laughter.
lavender
lavender,
law
lawn
lawn.
lawns
lay
laying
lead
leading
leaned
leaning
leap
leaping
leapt
learn
learned
learning
least
least,
leather
leave
leaves
leaving
led
lee
left
left,
left,'
left.
leg
leg.
legs
legs,
length
less
lesson
lesson,
lesson.
lessons
lessons,
lessons.
lestrange
let
let's
lets
letter
letter,
letter.
letters
letting
level
library
library,
lie
lied
lies
lies.
life
life.
lift
lift.
lifted
lifting
lifts
light
light,
light.
lightly
lights
like
like,
like,'
liked
likely
lily
limp
line
lined
lines
lip
lips
lips,
liquid
list
listen
listen,
listened
listening
listening.
lit
little
little.
live
lived
lives
living
load
loads
loathed
lock
locked
lockhart's
london,
long
long,
long.
longbottom
longbottom,
longer
look
look,
look.
looked
looked,
lookin'
looking
looks
looks.
lopsided
lord
lord's
lord,
lose
losing
loss
lost
lot
loud
loud,
louder
loudly
loudly,
loudly.
love
lovegood
lovegood,
lovely
low
low,
lower
lowered
lowering
lucius
luck,
lucky
luggage
luna
luna,
luna.
lunch
lunch,
lupin
lupin's
lupin,
lupin.
lurking
lyin'
lying
m
macmillan
mad
mad-eye
madam
made
magazine
magic
magic,
magic.
magic.'
magical
magnolia
magorian
magorian.
make
makes
making
malfoy
malfoy's
malfoy,
malfoy.
man
man's
man,
manage
managed
managing
many
map
marble
march
marchbanks
marched
marching
marietta
marietta,
mark
marked
marking
marks
mass
massive
master
mastered
match
match.
mate,'
mates
matter
matter,
matter?'
matters
may
maybe
mcgonagall
mcgonagall's
mcgonagall,
mcgonagall.
me
me!
me!'
me,
me,'
me.
me.'
me?
me?'
mean
mean,
mean.'
mean?'
meaning
means
meant
meanwhile,
meet
meeting
meetings
meetings,
member
members
memories
memory
memos
men
mention
mentioned
mere
merely
mess
message
messed
messing
met
metal
method
michael
midair
middle
midnight
might
mildly
miles
millicent
mind
mind,
mind,'
mind.
mine
minerva,
mingled
minister
minister,
ministry
ministry's
ministry,
ministry.
minute
minute,
minutes
minutes,
minutes.
mirror
miserable
miserably
miserably.
miss
missed
missing
mistake
mixed
mixture
mock
molly
molly,
molly,'
moment
moment,
moment,'
moment.
moment.'
momentarily
moments
monday
monocle
montague
montague,
month
months
mood
mood,
moody
moody's
moody,
moody.
moon
moonstone
mopping
more
more'n
more,
more,'
more.
more.'
morning
morning,
morning.
most
moth-eaten
mother
mother's
mother,
mother.'
motionless
mound
mountain
mounting
mouth
mouth,
mouth.
mouthful
move
move.
moved
movement
moving
mr
mrs
much
much,
much,'
much.
muffled
muggle
muggles
mum
mum's
mumbled
mumbled.
mundungus
mundungus,
mungo's
mungo's,
murder
murdered
murderer
murmur
murmured
murtlap
must
muttered
muttered,
muttered.
muttering
my
myself
mysteries
mysteries,
mysteries?'
n
name
name,
name,'
name.
named
names
narrow
narrowed
narrowly
nasty
near
nearby
nearby,
nearer
nearer,
nearer.
nearest
nearly
neatly
necessary
neck
neck.
need
needed
needs
neighbours
neither
nervous
nervous.
nervously
nervously.
network
never
nevertheless,
neville
neville's
neville,
neville.
new
newly
news
news,
newspaper
newt
next
nice
nick
nick,
nick.
nigellus
nigellus,
night
night,
night,'
night.
night.'
nights
nine
nine,
no
no!'
no,
no,'
no.
noble
nobody
nod
nodded
nodded,
nodded.
nodding
noise
noise,
noise.
noises
noises.
none
nor
normal
normally
norris
nose
nose,
nose.
not
not!'
not,
not,'
not.
not?'
note
note,
notes
notes,
nothing
nothing,
nothing.
notice
notice.
noticed
noticed,
now
now!'
now,
now,'
now.
now.'
now;
now?
now?'
nowhere
nowhere,
nudged
numb
number
numbers
o'
o'clock
o'clock,
oak
objects
obscured
observed
observing
obvious
obviously
occasion
occasional
occasionally
occlumency
occurred
odd
odd,
oddly
of
of,
off
off,
off.
offer
offered
office
office,
office,'
office.
official
often
oh
oh,
ok
ok,
ok,'
ok?'
old
older
olympe
ominous
on
on!'
on'y
on,
on,'
on.
on.'
on?'
once
once,
once.
once;
one
one!'
one's
one,
one,'
one.
one.'
ones
only
open
open,
open.
open;
opened
opened.
opening
opportunity
opposite
or
oracle
orange
order
order,
order,'
ordered
ordering
orders
ordinary
other
other,
other.
others
others,
others.
otherwise
ought
our
ourselves
ourselves,
out
out!
out!'
out,
out,'
out.
out.'
outbreak
outline
outraged.
outside
outside,
outside.
outstretched
outta
over
over,
over.
overhead
overheard
owl
owl's
owl,
owlery
owls
owls.
own
own,
own.
p
pace
pacing
package
packed
padma
page
page,
pages
paid
pain
pain.
painful
painfully
painfully.
pair
pairs
pale
pale,
panic
pansy
panted,
panting
paper
paper.
papers
parchment
parchment,
parchment.
parents
parents'
parents,
parkinson
part
particular
particularly
party
parvati
parvati,
pass
passed
passed,
passed.
passes
passing
past
patch
patches
path
patil
patronus
patronus?'
patted
patting
pause
paused
pausing
pay
pearly-white
peculiar
peer
peered
peering
peeves
peeves,
pensieve
pensieve,
pensieve.
people
people,
people.
people?'
perched
percy
percy's
percy,
perfect
perfectly
perform
performance
performing
perhaps
perhaps,
permanent
permission
permit
permitted
perplexed.
person
person.
personally
persuade
petunia
petunia's
petunia,
petunia.
phineas
phoenix
photograph
photographs
pick
picked
picking
picture
picture,
pictures
piece
pieces
pigwidgeon
pile
pine
pink
pinned
pipe
pit
pitch
pitch,
pitch.
place
place!'
place,
place,'
place.
placed
places
placing
plain
plainly
plan
planning
plans
plant
plate
plates
platform
play
played
player
players
playing
please
please!'
please,
please.'
pleased
pleased.
pleasure
plenty
plump
plunged
plunging
pocket
pocket.
podmore
point
point,
point,'
pointed
pointing
points
poison
poked
poking
polished
polite
pomfrey
pomfrey,
pool
pool.
poor
popping
popular
portkey
portrait
portraits
position
position,
position.
positively
possessed
possessing
possibility
possible
possible,
possibly
post
poster
posters
pot
potion
potion,
potions
potions,
potions.
potter
potter!'
potter's
potter,
potter,'
potter.
potter.'
potter?
potter?'
pouchy
pounded
pounding
pouring
powder
power
powerful
practical
practice
practise
practising
precise
precisely
prefect
prefects
prefer
preferred
prepared
presence
present
pressed
pressing
pressure
pretend
pretended
pretending
pretty
prevent
prevented
previous
price
prickling
pride
private
privet
probably
problem
problem,'
proceeded
prodding
produce
produced
producing
professor
professor,
progress
prominent
promise
promised
pronounced
proof
proper
properly
prophecy
prophecy,
prophet
prophet,
prophet.
prospect
protect
proud
prove
proved
pub
public
pull
pulled
pulling
pumping
pumpkin
punish
pure-blood
purple
push
pushed
pushing
put
putting
puzzled,
pyjamas
pyjamas.
quaffle
quaffle,
question
question.
questions
queue
quibbler
quibbler,
quibbler.
quick
quick,
quickly
quickly,
quickly.
quidditch
quiet
quiet,
quietly
quietly,
quietly.
quill
quill,
quill.
quills
quite
quivering
race
racing
rage
rage.
rain
raise
raised
raised,
raised.
raising
ran
rang
rapidly
rapped
rather
rattled
rattling
ravenclaw
ravenclaws
reach
reached
reaching
react
read
read.
read:
reading
ready
ready,
real
realise
realised
realising
really
really,
really,'
reappeared
reason
reason,
reasonable
receive
received
receiving
recent
recently
reckon
reckons
recognise
recognised
record
recovered
red
red.
reduced
reflected
reflection
refused
regret
regular
regurgitating
released
relief
relief,
relief.
relieved
reluctant
remain
remained
remaining
remedial
remember
remember,
remember?
remember?'
remembered
remembering
remind
reminded
reminding
remove
removed
remus
renewed
repeated
repeated,
repeated.
replaced
replied
report
reported
required
requirement
rescue
resembled
responsible
rest
restriction
results
retreated
retrieve
return
returned
returned,
returning
reveal
revealing
revising
revision
ribs.
rid
ride
righ',
right
right,
right,'
right.
right;
right?
right?'
rigid
ring
ringing
rip
ripped
rise
rising
risk
rita
rita,
road
road.
roar
roared
roaring
robes
robes,
robes.
roger
roll
rolled
rolling
rolls
ron
ron!'
ron's
ron,
ron,'
ron.
ron.'
ron?'
rookwood,
room
room,
room.
room:
room;
ropes
rose
rough
roughly
round
round,
round.
rounded
rounding
row
row,
row.
rows
rubbed
rubbing
rubbish
ruddy
rumbling
rummaging
run
run,
runes
running
rush
rustle
s
s'pose
sack
sacked
sad
sadly.
safe
safely
sagging
said
said,
said.
said:
sake,
same
same.
sank
sarcastically.
sat
satisfaction
satisfaction,
satisfaction.
satisfied
saturday
save
saved
saw
saw,
say
say,
say,'
say.
say?'
saying
saying,
says
says,
scanned
scanning
scar
scar,
scar.
scared
scarlet
scarves
scene
school
school,
school,'
school.
school.'
schoolbag
scrambled
scratched
scratching
scream
screamed
screamed,
screamed.
screaming
screams
screeches
screwed
scribbled
scribbling
scroll
sealed
sealing
seamus
seamus's
seamus,
search
seared
seat
seat,
seated
seats
second
second,
second-years
seconds
seconds,
seconds.
secrecy
secret
secrets
security
see
see,
see,'
see.
see?
seeing
seeking
seem
seemed
seemed,
seems
seen
seen,
seen.
seize
seized
seizing
sell
send
sending
senior
sensation
sense
sent
sentence
separated
serenely.
series
serious
seriously
seriously,
seriously.
set
setting
settle
settled
seven
seventh
several
severe
severed
shacklebolt
shade
shadow
shadows
shadowy
shaggy
shake
shakily.
shaking
shaking,
shaking.
shall
shape
shaped
share
sharp
sharply
sharply,
sharply.
shattered
she
she'd
she'll
she's
she,
she?'
sheet
shelf
shelves
shield
shifted
shifting
shimmering
shining
shiny
shivering
shock
shocked
shocked.
shook
shooting
shop
shop,
short
short,
shortly
shortly.
shot
should
should've
shoulder
shoulder,
shoulder.
shoulders
shoulders,
shoulders.
shouldn't
shout
shouted
shouted,
shouted.
shouting
shoved
shoving
show
showed
showing
shown
shrewd
shriek
shrieked
shrieked.
shrieking
shrugged.
shrugging.
shuddering
shuffled
shut
shut.
sick
sick.
side
side,
side.
sideways
sideways,
sigh
sighed
sighed.
sight
sight,
sight.
sign
sign,
signed
significant
signs
silence
silence,
silence.
silent
silent,
silent.
silently
silly
silly,
silver
silvery
similar
simple
simply
simply.
since
singing
single
sink
sinking
sir
sir!'
sir,
sir,'
sir?'
sirius
sirius!'
sirius's
sirius,
sirius.
sirius?'
sit
sitting
situation
six
sixteen
sixth
size
skin
skin,
skiving
sky
sky.
slack
slammed
slamming
sleep
sleep.
sleeping
slid
slide
sliding
slight
slightest
slightly
slightly,
slightly.
slimy
slip
slipped
slipping
slit
slits
slow
slowly
slowly,
slowly.
slumped
slytherin
slytherins
slytherins,
small
small,
smashed
smashing
smell
smile
smile,
smile.
smiled
smiled.
smiling
smiling.
smirking
smirking.
smith
smith,
smoke
smoking
smooth
smoothly
smoothly.
snackboxes
snake
snake's
snake,
snape
snape's
snape,
snape.
snape?'
snapped
snapped,
snarled
snarled.
snatched
snatching
sneak
sneered
sneering
snide
sniffing
sniggered.
snitch
snitch,
snort
snow
so
so,
so,'
so.
soar
soared
soaring
sobbed
sobbing
socks
soft
softly
softly,
softly.
solid
some
somebody
somehow
someone
someone's
something
something,
something.
something.'
something?'
sometimes
sometimes,
somewhat
somewhere
somewhere,
son
son,
song
soon
soon,
sooner
sorry
sorry!'
sorry,
sorry,'
sort
sorting
sorts
sought
sound
sound.
sounded
sounding
sounds
source
space
span
spare
sparks
spat
speak
speak,
speak.
speaking
special
spectacles
sped
speech
speech.
speed
speeding
spell
spell,
spell.
spells
spend
spending
spent
spheres
spilling
spinnet
spinning
spiral
spirits
spite
split
spoke
spoke,
spoke.
spoken
spot
spot,
spotted
sprang
spraying
spread
spreading
sprinted
sprinting
sprout
squad
square
squarely
squeaked
squeezed
squeezing
squinted
squinting
st
stack
stadium
staff
stag
staggered
staircase
staircase,
staircase.
stairs
stairs,
stairs.
stalked
stan
stand
standard
standing
stands
stare
stared
staring
stars
start
start,
started
starting
state
station
statue
statues
statute
stay
staying
steadily
steak
steal
steam
step
stepped
steps
steps.
stew
stick
sticking
stiffly.
still
still,
stirred
stolen
stomach
stomach.
stone
stone,
stood
stood,
stood.
stooped
stop
stopped
stopping
stories
storm
story
story,
story.
straight
straightened
straightening
strained
strange
strange,
streaked
stream
streaming
street
strengthening
stretch
stretched
stretching
striding
strike
string
strode
stroking
strolled
strong
struck
struggle
struggled
struggling
stubby
stuck
student
students
students,
students.
study
study.
stuff
stuffed
stuffing
stumped
stun
stunned
stunned.
stunning
stupid
stupid,
sturgis
subject
subjects
substance
successfully
such
sudden
suddenly
suddenly,
suffered
suggest
suggested
suit
summer
summer,
summer.
sun
sunday
sunlight
sunlit
sunshine
support
suppose
supposed
suppressed
sure
sure,
surely
surface
surge
surprise
surprise,
surprise.
surprised
surprised.
surrounded
surrounding
surveyed
surveying
survived
susan
suspected
suspended
suspicious
swallow
swallowed
swayed
swaying
swear
sweeping
sweet
sweetly,
sweetly.
swelled
swelling
swept
swiftly
swimming
swinging
swollen
swooped
swooping
swore
sworn
swung
sybill
t
t-shirt
table
table,
table.
tables
tables,
tail
take
taken
takes
taking
talk
talked
talking
talking,
talking.
tall
taller
tapestry
tapped
tartan
task
taught
tea
teach
teacher
teacher,
teachers
teachers,
teaching
teacup
team
team,
team.
teams
tearing
tears
tears.
teeth
teeth,
teeth.
telephone
telescope
tell
tell.
telling
tells
temper
temper.
temple
tempted
ten
ten,
tense
tentatively.
ter
term
terms
terrible
terrified
terror
terry
test
tested
tha'
tha's
than
thank
thanks
thanks,'
that
that!'
that'll
that's
that,
that,'
that.
that.'
that?'
the
their
them
them!'
them,
them,'
them.
them.'
them:
them;
them?'
themselves
themselves,
themselves.
then
then!'
then,
then,'
then.
then.'
then?
then?'
theory
there
there!'
there's
there,
there,'
there.
there.'
there;
there?'
therefore
these
thestral
thestrals
they
they'd
they'll
they're
they've
they,
they?
they?'
thick
thick,
thin
thing
thing,
thing,'
thing.
thing?'
things
things,
things.
things?'
think
think,
think,'
thinking
thinks
third
this
this,
this,'
this.
this.'
this:
this;
this?'
thoroughly
those
though
though,
though,'
though.
though.'
thought
thought,
thought,'
thought.
thoughts
threadbare
threatening
three
three,
threshold
threw
throat
throat.
throbbing
through
throw
throwing
thrown
thrust
thrusting
thud
thumping
tied
tight
tightly
till
time
time!'
time,
time,'
time.
time.'
time;
time?'
times
times,
tin
tiny
tiny,
tip
tipped
tips
tired
to
to,
to,'
to.
to.'
to?'
toad
toadlike
toast
today
today,
tofty
together
together,
together.
toilet
told
tomorrow
tomorrow,
tomorrow.
tone
tongue
tonight
tonight,
tonight.
tonks
tonks,
tonks.
too
too!
too!'
too,
too,'
too.
too.'
too;
took
top
topmost
toppled
torches
tore
tortured
tottering
touch
touched
touching
tournament
towards
tower
tower.
towering
trace
track
trailed
trailing
train
training
traitor
traitors
transfiguration
trapped
travelled
travelling
treat
treated
tree
tree,
tree.
trees
trees,
trees.
trelawney
trelawney's
trelawney,
trembled
trembling
trembling.
trick
trickled
tried
trip
triumphant
triwizard
trolls
trouble
trouble,
true
true,
truly
trunk
trunk,
trunk.
trunks
trust
truth
truth,
try
trying
trying,
tugging
turn
turn.
turned
turned,
turned.
turning
turns
twelfth
twelve
twelve,
twenty
twice
twins
twins.
twisted
twisting
twitched
twittering
two
two,
two.
ugly
umbrella
umbridge
umbridge's
umbridge,
umbridge,'
umbridge.
umbridge?'
unable
unaware
uncertainly,
uncertainly.
uncle
uncomfortable
unconscious
under
underage
underground
underneath
undersecretary
understand
understand?'
understanding
understood
undertone,
undoubtedly
uneasy.
unfortunately
unfortunately,
unkempt
unless
unlike
unlikely
unmistakeable
unnecessarily
unpleasant
until
unusual
up
up!'
up,
up,'
up.
up.'
up?'
upon
upper
upright
upset
upside-down
upstairs
upstairs,
upwards
urge
urgently,
urgently.
us
us!'
us,
us,'
us.
us.'
us?'
use
used
useful
useless
uses
using
usual
usual,
usual.
usually
utter
uttered
utterly
vague
vaguely
vaguely,
vanish
vanished
vanished.
vanished;
vanishing
vapour
various
veil
veil.
velvet
vernon
vernon's
vernon,
vernon.
very
view
violent
violently
visible
vision
visit
visitors
voice
voice,
voice.
voices
voices.
voldemort
voldemort's
voldemort,
voldemort.
wait
waited
waiting
wake
walk
walked
walking
wall
wall,
wall.
walls
walls,
walls.
wand
wand,
wand.
wand;
wandered
wandering
wands
want
want,
wanted
wanting
wants
ward
wardrobe
warlock
warm
warn
warned
warning
warnings
warrington
warrington,
was
was,
was.
wasn'
wasn't
waste
wasting
watch
watch,
watch.
watched
watched,
watching
water
water,
wave
waved
waving
way
way!'
way,
way,'
way.
ways
we
we'd
we'll
we're
we've
we,
we?'
weak
weakly,
weakly.
weapon
wear
wearily.
wearing
weasley
weasley's
weasley,
weasley,'
weasley.
weasleys'
weasleys,
weather
wednesday
week
week's
week,
weekend
weeks
weight
weird
welcome
well
well,
well,'
well.
well?'
wen'
went
went.
were
were,
weren't
what
what's
what,
what?'
whatever
whatsoever
wheeled
when
when,
whenever
where
where's
wherever
whether
which
which,
while
while,
whinging
whinging,
whipped
whipping
whirled
whisper
whisper,
whisper.
whispered
whispered,
whispered.
whispering
whispering,
whistle
white
white,
who
who's
who,
whoever
whole
whom
whose
why
why,
why?'
wide
wide,
widely
widened
wife
wild
wildly
will
willing
willy
win
wind
wind.
window
window,
window.
windows
windows,
windows.
wing
wing,
wing.
winged
wings
wiped
wiping
wish
wished
wishes
wishing
wisteria
witch
witch,
witchcraft
witches
with
withdrawing
withdrew
within
without
witnessed
wizard
wizard,
wizard.
wizarding
wizards
wizards,
wizengamot
wizengamot,
woman
woman's
woman,
won
won'
won't
wonder
wondered
wonderful
wondering
wood
wooden
woolly
word
word,
word.
words
words,
words.
wore
work
work,
work.
worked
working
works
world
world,
wormtail
worn
worried
worried.
worry
worry,
worrying
worse
worse.
worst
worth
would
would've
would,'
wouldn'
wouldn't
wound
wounds
wrapped
wrenched
wringing
wrist.
write
writing
written
wrong
wrong,
wrong,'
wrote
yawned
yawning
yeah
yeah,
yeah,'
yeah?'
year
year,
year,'
year.
year.'
years
years,
years.
years.'
yeh
yeh'll
yeh've
yeh,
yell
yelled
yelled,
yelled.
yelling
yellow
yells
yer
yes
yes,
yes,'
yet
yet,
yet,'
yet.
yet?'
you
you!
you!'
you'd
you'll
you're
you've
you,
you,'
you-know-who
you-know-who's
you-know-who,
you.
you.'
you?
you?'
young
young,
your
yours
yours,
yourself
yourself,
yourselves
yule
zacharias
zoomed
zooming
